What is this? Am I flying? ..

Am I…

dead?

The darkness was total and she was alone in it: a presence, a stray thought lost in the void.

“My name… is Selvira,” she tried to whisper, to reassure herself that she at least was real, but she had no lips with which to speak, and no ears with which to hear.

Is this… my punishment…?

There was nothing at all that she could do, so she reined in her panic, composed herself as best she could, and simply waited to see what, if anything would happen.

She could not have said at what specific point the nothing around her became something… it happened slowly by degrees, so that by the time she became aware of it, there was already ground beneath her feet and a sweet, oddly familiar scent drifting in the air. The air… there was air now. A soft, warm breeze touched her face and tugged at lose strands of her hair.

She took a long breath, her first, and opened her eyes. And the sun was setting over the fields of Ebletain, in a whirlpool of rose and gold.

But… I destroyed Hyrim…

“Evening.”She whirled around. There was a great tree in luxurious bloom, and a man leaning against it, his arms folded casually across his breast. His hair was dark brown, thick, and quite short by elven standards, only just reaching down to his shoulders. He wore a dark green traveler’s tunic and a giant two-handed sword. Raising his head, he looked at her with clear brown eyes, and in one corner of his mouth quirked a familiar smile.

“...Father?” Selvira said, stunned.

“In a manner of speaking.” The elven speech was prominent in the other man’s accent, but there was also a hint of the roughness of the common tongue. She could hear it there now, after spending so much time travelling the world.

“I… It’s been so long since I last saw you,” she said. “You look like me.”

“You’ve got it backwards, child. You’re the one who looks like me. How’s the training today?”That was what he’d always said, when she came running home after training and playing with the other children of the village. Tears stung in her eyes. “Father, I’ve made such a mess of it all...”

“That you have.” The man said. “What are you going to do about it?”

She stared. “Is there something I can do?”

“That depends.”

“On what?”

The man nodded his head towards her. “Look behind you...”

She turned around, slowly.

At first the sun’s brilliance blinded her, and she had to shield her eyes with her hand. Two wide pebbled paths stretched away from where she now stood. One led towards the vast forests of Arolas and the village of Lonia, into a stunning sea of green and gold; she couldn’t look at it for long. The other was bare and edged with tangles and thorns; it wound away to the north, towards Griffinfort and Omok’s Treasury under a purple sky, the color of a bruise. A little child could have understood the message.

“It’s not as simple as it looks,” her father said, coming up to stand beside her.

She sighed and lowered her hand. “It never is… He really killed me, didn’t he?” She touched her chest for a moment, remembering that icy moment when she’d felt the sword sink in. There was no wound there now. “Is this my afterlife, then?”

“It could be.”

“So I have to choose a path. Where do they go?”

“They both go to the same place,” her father said implacably. “Death.”

She closed her eyes and lowered her head. “Then I really have failed...”

“That depends on what you consider failure.” A hand rested on her shoulder, warm and comforting. She glanced at it and saw something she knew from her childhood. A strong hand with callused fingers striped with pale scars from ancient battles. It was the hand of a swordsman. Bittersweet memories crowded her head, she’d heard the story behind each one of those marks at one time or another. Had even counted them out aloud innocent of their meaning when learning her numbers. Once, barely more than an infant, she’d sliced herself on a dagger, right into the flesh of her palm, and her father had treated her with those same skilled hands. 

“We’re close to the edge now,” the man said. “There’s more at stake here than you know.”

She pulled away and stared, seeing the old wise eyes in his young face.

“What do you mean?”

“Figure it out, child,” her father said, turning away from her, “you’re the hero now. Anyway, you haven’t got time to hear it. You must choose and be gone before the sun sets.” He walked slowly back towards the great tree, leaning on his great sword as he sat down at it’s foot.

She turned again to face the two roads, the light and the dark. Distantly in the west, she could see a woman with red hair and a white dress, and her breath was caught in her chest; the stab of pain that went through her was surprising her in it’s strength. Another old memory, like a box forgotten in an attic and now opened after many years to reveal it’s treasures still intact within, still smelling of spring. “Mother...”

“You said it wasn’t as simple as it looks,” she said softly. “But if they both go to the same place, then does it matter which one I pick?”

“Listen. This choice is offered to you and you alone, because of who you are, and what you bear within you. One path leads to your death, and an end from pain. For you, it’ll stop. For you, it’d be easiest. For your friends, great suffering. The other road leads to the death of a friend. But if you choose that way you might still have a chance to save some of those you love.”

She made a sad smile. “Great choice. And I suppose you can’t tell me which way is which.”

“You already know.”

“It’s the same choice as the one I made all those years ago, when I went after Ilas.”

“Very similar,” her father agreed.

Still, she hesitated, glancing from one way to the other. Griffinfort and Arolas. The hard way, and the easy. In the west, the sun was sinking swiftly, already half out of sight behind the sea of trees. “What if I stayed behind,” she said. “What happens when the sun sets?”

There was no answer. She glanced back, over her shoulder, and the great tree was gone. The field stood bare and empty in a gathering dusk.

“If it was just me,” she said aloud, “this would be simple.”

Your death… the death of a friend…

To save some of those you love…

In an instant, she made her decision. She turned to the west, to the brilliance of the setting sun. It was almost gone now, only a few beads of light glowing on the distant treetops. “Mother… Father… wait for me a little longer,” she called softly, and thought she saw a small figure move in the distance.

She ran north, into darkness.









There was nothing.

And then, unexpectedly, there was something… a sound.

Thud/Thud.
She was cold, terribly cold. Something squeezed in her chest like a clenched fist. And by the gods, it hurt…

Thud/thud.

The first breath was the hardest, she had to will herself to take it, against the weight of monstrous pain that was pressing in, eager to be acknowledged. Dried blood had clotted on her lips, and it cracked away as she dragged air forcibly into her lungs, every inch of her body screaming protest. The muted agony in her back and neck was overpowered by a hot electric fire in her right hand, but that was dying down even as she became aware of it.

Someone was holding her, propping her up. She felt the grip of arms around her chest. A sharp shocked intake of breath.

“Graves,” she tried to say, and choked on something; she started coughing and couldn’t stop, though it felt as if  the convulsions would tear her whole body apart. They died down at last when she was too exhausted to cough any more. A red-hot line with perfectly sewn stitches stretched down from her chest and across her body, but at least she could breathe. She seemed to be whole, but couldn’t say much more than that for now. Her mouth tasted of blood.

“I’m so cold...” Her body jerked of it’s own accord and began to shiver violently; her fingers and toes were a tingling fire. “Graves...”
